src/Documents/Доходы/Доходы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Доходы</name>
  <registerRecords>AccumulationRegister.Баланс</registerRecords>
  <registerRecords>AccumulationRegister.Доходы</registerRecords>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюта</types>
    </type>
  </attributes>
  <attributes>
    <name>КатегорияДоходов</name>
    <type>
      <types>CatalogRef.КатегорииДоходов</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Счет</name>
    <type>
      <types>CatalogRef.Счета</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Document>

src/Documents/Расход/Расход.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Расход</name>
  <registerRecords>AccumulationRegister.Баланс</registerRecords>
  <registerRecords>AccumulationRegister.Расходы</registerRecords>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюта</types>
    </type>
  </attributes>
  <attributes>
    <name>КатегорияРасхода</name>
    <type>
      <types>CatalogRef.КатегорииРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Счет</name>
    <type>
      <types>CatalogRef.Счета</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Document>

src/Documents/Переводы/Переводы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Переводы</name>
  <registerRecords>AccumulationRegister.Баланс</registerRecords>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюта</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СчетИсточник</name>
    <type>
      <types>CatalogRef.Счета</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетПолучатель</name>
    <type>
      <types>CatalogRef.Счета</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Document>

src/Documents/ПередачаСредствВДолг/ПередачаСредствВДолг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПередачаСредствВДолг</name>
  <registerRecords>AccumulationRegister.Баланс</registerRecords>
  <registerRecords>AccumulationRegister.Долги</registerRecords>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ВидОперацииДолга</types>
    </type>
  </attributes>
  <attributes>
    <name>Контакт</name>
    <type>
      <types>CatalogRef.Контакты</types>
    </type>
  </attributes>
  <attributes>
    <name>Счет</name>
    <type>
      <types>CatalogRef.Счета</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюта</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Document>

src/CommonModules/ОбщийМодульСервер_Безопасность/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Общий модуль сервер: безопасность Wallet.
// PIN-код, скрытие сумм, проверка использования объектов, токены Google.
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Признак включённого PIN-кода (есть хеш и флаг).
//
Функция ПинВключен() Экспорт
	
	Возврат Константы.ИспользоватьПИН.Получить() И ЗначениеЗаполнено(Константы.ХешПИН.Получить());
	
КонецФункции

// Нужно показать форму разблокировки при старте.
//
Функция ТребуетсяРазблокировка() Экспорт
	
	Возврат ПинВключен();
	
КонецФункции

// Биометрия включена в настройках.
//
Функция БиометрияВключена() Экспорт
	
	Возврат Константы.ИспользоватьБиометрию.Получить() И ПинВключен();
	
КонецФункции

// Сведения для экрана безопасности.
//
Функция СведенияДляЭкранаБезопасности() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("ПинВключен", ПинВключен());
	Результат.Вставить("БиометрияВключена", Константы.ИспользоватьБиометрию.Получить());
	Результат.Вставить("СкрыватьСуммы", Константы.СкрыватьСуммы.Получить());
	
	Возврат Результат;
	
КонецФункции

// Проверяет PIN. Возвращает структуру Успех, Текст.
//
Функция ПроверитьПИН(ПИН) Экспорт
	
	Результат = Новый Структура("Успех, Текст", Ложь, "");
	Код = СокрЛП(Строка(ПИН));
	
	Если Не ПинВключен() Тогда
		
		Результат.Успех = Истина;
		Возврат Результат;
		
	КонецЕсли;
	
	Если СтрДлина(Код) < 4 Или СтрДлина(Код) > 6 Тогда
		
		Результат.Текст = "Введите PIN из 4–6 цифр.";
		Возврат Результат;
		
	КонецЕсли;
	
	Если ХешПИНКода(Код) <> Константы.ХешПИН.Получить() Тогда
		
		Результат.Текст = "Неверный PIN-код.";
		Возврат Результат;
		
	КонецЕсли;
	
	Результат.Успех = Истина;
	
	Возврат Результат;
	
КонецФункции

// Устанавливает новый PIN (4–6 цифр). Требует совпадения Подтверждение.
//
Функция УстановитьПИН(ПИН, Подтверждение) Экспорт
	
	Результат = Новый Структура("Успех, Текст", Ложь, "");
	Код = СокрЛП(Строка(ПИН));
	ПодтверждениеКод = СокрЛП(Строка(Подтверждение));
	
	Если СтрДлина(Код) < 4 Или СтрДлина(Код) > 6 Или Не ТолькоЦифры(Код) Тогда
		
		Результат.Текст = "PIN должен содержать 4–6 цифр.";
		Возврат Результат;
		
	КонецЕсли;
	
	Если Код <> ПодтверждениеКод Тогда
		
		Результат.Текст = "Коды не совпадают. Повторите ввод.";
		Возврат Результат;
		
	КонецЕсли;
	
	Константы.ХешПИН.Установить(ХешПИНКода(Код));
	Константы.ИспользоватьПИН.Установить(Истина);
	
	Результат.Успех = Истина;
	Результат.Текст = "PIN-код включён.";
	
	Возврат Результат;
	
КонецФункции

// Отключает PIN после проверки текущего кода.
//
Функция ОтключитьПИН(ПИН) Экспорт
	
	Результат = ПроверитьПИН(ПИН);
	
	Если Не Результат.Успех Тогда
		
		Возврат Результат;
		
	КонецЕсли;
	
	Константы.ИспользоватьПИН.Установить(Ложь);
	Константы.ХешПИН.Установить("");
	Константы.ИспользоватьБиометрию.Установить(Ложь);
	
	Результат.Текст = "PIN-код отключён.";
	
	Возврат Результат;
	
КонецФункции

// Включает/выключает биометрию (только при активном PIN).
//
Функция УстановитьБиометрию(Включить) Экспорт
	
	Результат = Новый Структура("Успех, Текст", Ложь, "");
	
	Если Включить И Не ПинВключен() Тогда
		
		Результат.Текст = "Сначала включите PIN-код.";
		Возврат Результат;
		
	КонецЕсли;
	
	Константы.ИспользоватьБиометрию.Установить(Включить);
	Результат.Успех = Истина;
	Результат.Текст = ?(Включить, "Биометрия включена.", "Биометрия выключена.");
	
	Возврат Результат;
	
КонецФункции

// Признак скрытия сумм.
//
Функция СкрыватьСуммы() Экспорт
	
	Возврат Константы.СкрыватьСуммы.Получить();
	
КонецФункции

// Переключает скрытие сумм. Возвращает новое значение.
//
Функция ПереключитьСкрытиеСумм() Экспорт
	
	НовоеЗначение = Не Константы.СкрыватьСуммы.Получить();
	Константы.СкрыватьСуммы.Установить(НовоеЗначение);
	
	Возврат НовоеЗначение;
	
КонецФункции

Процедура УстановитьСкрытиеСумм(Скрывать) Экспорт
	
	Константы.СкрыватьСуммы.Установить(Скрывать);
	
КонецПроцедуры

// Маска для скрытых сумм.
//
Функция МаскаСуммы() Экспорт
	
	Возврат "••••";
	
КонецФункции

// Текст подтверждения удаления с учётом использования объекта.
//
Функция ТекстПодтвержденияУдаления(Ссылка) Экспорт
	
	Сведения = СведенияОбИспользовании(Ссылка);
	Имя = Строка(Ссылка);
	
	Если Сведения.Количество = 0 Тогда
		
		Возврат "Удалить «" + Имя + "»? Объект будет помечен на удаление.";
		
	КонецЕсли;
	
	Возврат "«" + Имя + "» используется в " + Формат(Сведения.Количество, "ЧГ=0") + " "
		+ Сведения.Подпись + ". Удалить (пометить на удаление)?";
	
КонецФункции

// Количество ссылок/движений по объекту.
//
Функция СведенияОбИспользовании(Ссылка) Экспорт
	
	Результат = Новый Структура("Количество, Подпись", 0, "операциях");
	
	Если Не ЗначениеЗаполнено(Ссылка) Тогда
		
		Возврат Результат;
		
	КонецЕсли;
	
	ТипСсылки = ТипЗнч(Ссылка);
	
	Если ТипСсылки = Тип("СправочникСсылка.Счета") Тогда
		
		Результат.Количество = КоличествоДокументовПоСчету(Ссылка);
		Результат.Подпись = ПодписьКоличества(Результат.Количество, "операции", "операциях", "операциях");
		
	ИначеЕсли ТипСсылки = Тип("СправочникСсылка.КатегорииДоходов") Тогда
		
		Результат.Количество = КоличествоДокументовПоКатегорииДоходов(Ссылка);
		Результат.Подпись = ПодписьКоличества(Результат.Количество, "документе", "документах", "документах");
		
	ИначеЕсли ТипСсылки = Тип("СправочникСсылка.КатегорииРасходов") Тогда
		
		Результат.Количество = КоличествоДокументовПоКатегорииРасходов(Ссылка);
		Результат.Подпись = ПодписьКоличества(Результат.Количество, "документе", "документах", "документах");
		
	ИначеЕсли ТипСсылки = Тип("СправочникСсылка.Контакты") Тогда
		
		Результат.Количество = КоличествоДокументовПоКонтакту(Ссылка);
		Результат.Подпись = ПодписьКоличества(Результат.Количество, "документе", "документах", "документах");
		
	ИначеЕсли ТипСсылки = Тип("СправочникСсылка.Валюта") Тогда
		
		Результат.Количество = КоличествоДокументовПоВалюте(Ссылка);
		Результат.Подпись = ПодписьКоличества(Результат.Количество, "документе", "документах", "документах");
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// --- Google-токены (ValueStorage + миграция со старых строковых констант) ---

Функция ЕстьТокеныGoogle() Экспорт
	
	МигрироватьТокеныGoogleИзСтроковыхКонстант();
	Токены = ПрочитатьТокеныGoogleИзХранилища();
	
	Возврат ЗначениеЗаполнено(Токены.Access) Или ЗначениеЗаполнено(Токены.Refresh);
	
КонецФункции

Функция ПолучитьGoogleAccessToken() Экспорт
	
	МигрироватьТокеныGoogleИзСтроковыхКонстант();
	
	Возврат ПрочитатьТокеныGoogleИзХранилища().Access;
	
КонецФункции

Функция ПолучитьGoogleRefreshToken() Экспорт
	
	МигрироватьТокеныGoogleИзСтроковыхКонстант();
	
	Возврат ПрочитатьТокеныGoogleИзХранилища().Refresh;
	
КонецФункции

Процедура СохранитьТокеныGoogle(AccessToken, RefreshToken = "") Экспорт
	
	Текущие = ПрочитатьТокеныGoogleИзХранилища();
	Access = СокрЛП(Строка(AccessToken));
	Refresh = СокрЛП(Строка(RefreshToken));
	
	Если Не ЗначениеЗаполнено(Refresh) Тогда
		
		Refresh = Текущие.Refresh;
		
	КонецЕсли;
	
	Данные = Новый Структура("Access, Refresh", Access, Refresh);
	Константы.GoogleТокеныХранилище.Установить(Новый ХранилищеЗначения(Данные, Новый СжатиеДанных(9)));
	Константы.GoogleAccessToken.Установить("");
	Константы.GoogleRefreshToken.Установить("");
	
КонецПроцедуры

Процедура ОчиститьТокеныGoogle() Экспорт
	
	Константы.GoogleТокеныХранилище.Установить(Новый ХранилищеЗначения(Неопределено));
	Константы.GoogleAccessToken.Установить("");
	Константы.GoogleRefreshToken.Установить("");
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ХешПИНКода(ПИН)
	
	Хеширование = Новый ХешированиеДанных(ХешФункция.SHA256);
	Хеширование.Добавить("Wallet.PIN.v1|" + ПИН);
	
	Возврат Base64Строка(Хеширование.ХешСумма);
	
КонецФункции

Функция ТолькоЦифры(СтрокаПроверки)
	
	Для Индекс = 1 По СтрДлина(СтрокаПроверки) Цикл
		
		Символ = Сред(СтрокаПроверки, Индекс, 1);
		
		Если СтрНайти("0123456789", Символ) = 0 Тогда
			
			Возврат Ложь;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

Функция ПодписьКоличества(Количество, Форма1, Форма2, Форма5)
	
	Остаток100 = Количество % 100;
	Остаток10 = Количество % 10;
	
	Если Остаток100 >= 11 И Остаток100 <= 14 Тогда
		
		Возврат Форма5;
		
	ИначеЕсли Остаток10 = 1 Тогда
		
		Возврат Форма1;
		
	ИначеЕсли Остаток10 >= 2 И Остаток10 <= 4 Тогда
		
		Возврат Форма2;
		
	КонецЕсли;
	
	Возврат Форма5;
	
КонецФункции

Функция КоличествоДокументовПоСчету(Счет)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Вложенный.Ссылка) КАК Количество
	|ИЗ
	|	(ВЫБРАТЬ
	|		Доходы.Ссылка КАК Ссылка
	|	ИЗ
	|		Документ.Доходы КАК Доходы
	|	ГДЕ
	|		Доходы.Счет = &Счет
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Расход.Ссылка
	|	ИЗ
	|		Документ.Расход КАК Расход
	|	ГДЕ
	|		Расход.Счет = &Счет
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Переводы.Ссылка
	|	ИЗ
	|		Документ.Переводы КАК Переводы
	|	ГДЕ
	|		Переводы.СчетИсточник = &Счет
	|		ИЛИ Переводы.СчетПолучатель = &Счет
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Долги.Ссылка
	|	ИЗ
	|		Документ.ПередачаСредствВДолг КАК Долги
	|	ГДЕ
	|		Долги.Счет = &Счет) КАК Вложенный";
	Запрос.УстановитьПараметр("Счет", Счет);
	
	Возврат КоличествоИзЗапроса(Запрос);
	
КонецФункции

Функция КоличествоДокументовПоКатегорииДоходов(Категория)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КОЛИЧЕСТВО(*) КАК Количество
	|ИЗ
	|	Документ.Доходы КАК Доходы
	|ГДЕ
	|	Доходы.КатегорияДоходов = &Категория";
	Запрос.УстановитьПараметр("Категория", Категория);
	
	Возврат КоличествоИзЗапроса(Запрос);
	
КонецФункции

Функция КоличествоДокументовПоКатегорииРасходов(Категория)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КОЛИЧЕСТВО(*) КАК Количество
	|ИЗ
	|	Документ.Расход КАК Расход
	|ГДЕ
	|	Расход.КатегорияРасхода = &Категория";
	Запрос.УстановитьПараметр("Категория", Категория);
	
	Возврат КоличествоИзЗапроса(Запрос);
	
КонецФункции

Функция КоличествоДокументовПоКонтакту(Контакт)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КОЛИЧЕСТВО(*) КАК Количество
	|ИЗ
	|	Документ.ПередачаСредствВДолг КАК Долги
	|ГДЕ
	|	Долги.Контакт = &Контакт";
	Запрос.УстановитьПараметр("Контакт", Контакт);
	
	Возврат КоличествоИзЗапроса(Запрос);
	
КонецФункции

Функция КоличествоДокументовПоВалюте(Валюта)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Вложенный.Ссылка) КАК Количество
	|ИЗ
	|	(ВЫБРАТЬ
	|		Доходы.Ссылка КАК Ссылка
	|	ИЗ
	|		Документ.Доходы КАК Доходы
	|	ГДЕ
	|		Доходы.Валюта = &Валюта
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Расход.Ссылка
	|	ИЗ
	|		Документ.Расход КАК Расход
	|	ГДЕ
	|		Расход.Валюта = &Валюта) КАК Вложенный";
	Запрос.УстановитьПараметр("Валюта", Валюта);
	
	Возврат КоличествоИзЗапроса(Запрос);
	
КонецФункции

Функция КоличествоИзЗапроса(Запрос)
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Возврат ?(Выборка.Количество = Null, 0, Выборка.Количество);
		
	КонецЕсли;
	
	Возврат 0;
	
КонецФункции

Функция ПрочитатьТокеныGoogleИзХранилища()
	
	Результат = Новый Структура("Access, Refresh", "", "");
	Хранилище = Константы.GoogleТокеныХранилище.Получить();
	
	Если Хранилище = Неопределено Тогда
		
		Возврат Результат;
		
	КонецЕсли;
	
	Данные = Хранилище.Получить();
	
	Если ТипЗнч(Данные) <> Тип("Структура") Тогда
		
		Возврат Результат;
		
	КонецЕсли;
	
	Если Данные.Свойство("Access") Тогда
		
		Результат.Access = СокрЛП(Строка(Данные.Access));
		
	КонецЕсли;
	
	Если Данные.Свойство("Refresh") Тогда
		
		Результат.Refresh = СокрЛП(Строка(Данные.Refresh));
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура МигрироватьТокеныGoogleИзСтроковыхКонстант()
	
	СтарыйAccess = СокрЛП(Константы.GoogleAccessToken.Получить());
	СтарыйRefresh = СокрЛП(Константы.GoogleRefreshToken.Получить());
	
	Если Не ЗначениеЗаполнено(СтарыйAccess) И Не ЗначениеЗаполнено(СтарыйRefresh) Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Текущие = ПрочитатьТокеныGoogleИзХранилища();
	Access = ?(ЗначениеЗаполнено(Текущие.Access), Текущие.Access, СтарыйAccess);
	Refresh = ?(ЗначениеЗаполнено(Текущие.Refresh), Текущие.Refresh, СтарыйRefresh);
	СохранитьТокеныGoogle(Access, Refresh);
	
КонецПроцедуры

#КонецОбласти
